#!/usr/bin/env python3

def display_message():
    print("Функция — именованный блок кода, предназначенный для решения одной конкретной задачи.")
    print("Определение функции - имя функции и описание информации, необходимой функции для решения задачи.")
    print("Тело функции - все строки с отступами, следующие за определением функции.")
    print("Параметр функции - условные данные, необходимые функции для выполнения ее работы.")
    print("Аргумент функции - конкретная информация, переданная при вызове функции.")

display_message()